# 1 savarjisho
for i in range (20):
    print(i + 1)

# 2 savarjisho
for i in range (19):
    print(i + 2)

# 3 savarjisho
# for ციკლი გამოიყენება, როცა ზუსტად ვიცით რამდენჯერ უნდა შესრულდეს ციკლი
for i in range(5):  # 0-იდან 4-მდე (ჯამში 5-ჯერ)
    print("for ციკლი:", i)

# while ციკლი გამოიყენება, როცა წინასწარ არ ვიცით რამდენჯერ შესრულდება,
# მაგრამ გვინდა, რომ სანამ პირობა ჭეშმარიტია, მანამ იმუშაოს
count = 0
while count < 5:
    print("while ციკლი:", count)
    count += 1

# 4 savarjisho

# ეს არის უსასრულო ციკლი — ციკლი, რომელიც არასდროს წყვეტს მუშაობას, თუ არ გავაჩერებთ პროგრამას ან არ გამოვიყენებთ break-ს

while True:
    print("ეს არის უსასრულო ციკლი")  # ეს შეტყობინება გამოდის უსასრულოდ
    # თუ გვინდა რომ გავაჩეროთ, შეგვიძლია დამატებითი პირობა შევამოწმოთ და break გამოვიყენოთ
    # მაგალითად:
    # if რაღაც_პირობა:
    #     break

# 5 savarjisho

counter = 15  # ვიწყებთ 15-დან

while counter <= 20:  # სანამ counter ნაკლებია ან ტოლია 20-ს
    print(counter)
    counter += 1  # ყოველ ჯერზე ვზრდით counter-ს ერთით

